[TC_WOTC_MWR_RPD_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>RPD</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>RPDs</b></font>"
AbilityDescName="light machinegun"
BriefSummary="The Puchnoy Pulemyot Degtyaryova (ручной пулемёт Дегтярёва), or in English, Degtyaryov hand-held machine gun, is a 7.62x39mm machinegun created by Vasily Degtyaryov in the Soviet Union in 1945, as a replacement for the DP machinegun. Out of the three contestants that submit their designs, Vasily Degtyaryov's design was chosen as the new light machinegun of the Soviet Armed Forces. The RPD was ready for deployment during the final stages of World War II, the weapon was not delivered until 1953. The Vietcong used the RPD as their standard light machinegun during the Vietnam War. Although the RPD was superseeded by the RPK in the 1960s, it is still in service today, in militarized African and Asian countries."
TacticalText="<Bullet/>Type: Light Machinegun\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated\n<Bullet/>Cartridge: 7.62x39mm\n<Bullet/>Origin: Soviet Union\n<Bullet/>Tier: Conventional"


[TC_WOTC_MWR_RPD_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>RVDMG-45</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>RVDMG-45s</b></font>"
AbilityDescName="light machinegun"
BriefSummary="The Puchnoy Pulemyot Degtyaryova (ручной пулемёт Дегтярёва), or in English, Degtyaryov hand-held machine gun, is a 7.62x39mm machinegun created by Vasily Degtyaryov in the Soviet Union in 1945, as a replacement for the DP machinegun. Out of the three contestants that submit their designs, Vasily Degtyaryov's design was chosen as the new light machinegun of the Soviet Armed Forces. The RPD was ready for deployment during the final stages of World War II, the weapon was not delivered until 1953. The Vietcong used the RPD as their standard light machinegun during the Vietnam War. Although the RPD was superseeded by the RPK in the 1960s, it is still in service today, in militarized African and Asian countries.\n This timeless classic has been upgraded to take down the alien forces, dubbed the RVDMG-45. The weapon is modified to fire stronger Armor-Piecing rounds that able to cut through the aliens' armor."
TacticalText="<Bullet/>Type: Light Machinegun\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated\n<Bullet/>Cartridge: 7.62x39mm\n<Bullet/>Origin: Soviet Union\n<Bullet/>Tier: Magnetic"

[TC_WOTC_MWR_RPD_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>RVDMG-45/203X</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>RVDMG-45/203Xs</b></font>"
AbilityDescName="light machinegun"
BriefSummary="The Puchnoy Pulemyot Degtyaryova (ручной пулемёт Дегтярёва), or in English, Degtyaryov hand-held machine gun, is a 7.62x39mm machinegun created by Vasily Degtyaryov in the Soviet Union in 1945, as a replacement for the DP machinegun. Out of the three contestants that submit their designs, Vasily Degtyaryov's design was chosen as the new light machinegun of the Soviet Armed Forces. The RPD was ready for deployment during the final stages of World War II, the weapon was not delivered until 1953. The Vietcong used the RPD as their standard light machinegun during the Vietnam War. Although the RPD was superseeded by the RPK in the 1960s, it is still in service today, in militarized African and Asian countries.\n The RPD is modified once more to counter the aliens' growing strength and advanced battlefield tech, designated RVDMG-45/203X. The barrel is embedded with high-frequency technology, making each shot pack more of a punch than ever. The receiver is also modified to allow the weapon to fire off more rounds without overheating the weapon."
TacticalText="<Bullet/>Type: Light Machinegun\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated\n<Bullet/>Cartridge: 7.62x39mm\n<Bullet/>Origin: Soviet Union\n<Bullet/>Tier: Beam"
